config.el
(setq user-full-name "NAME"
      user-mail-address "EMAIL")

;;(add-hook 'window-setup-hook #'toggle-frame-maximized) ;; this doesn't play wery with amethyst
;;(set-frame-parameter nil 'alpha  '70)
(defun my/set-frame-alpha (&optional arg)
  (if
      (and arg (not (string-empty-p arg)))
      (set-frame-parameter nil 'alpha  (string-to-number arg))
    (set-frame-parameter nil 'alpha 90)))

(defun my/interactive-set-frame-alpha (&optional arg)
  (interactive "sFrame Alpha? ")
  (my/set-frame-alpha arg))

(evil-define-command my/evil-set-frame-alpha (&optional arg)
  (interactive "<a>")
  (my/set-frame-alpha arg))

(evil-ex-define-cmd "set-alpha" #'my/evil-set-frame-alpha)
(add-to-list 'default-frame-alist '(alpha . 90 ))
(setq frame-alpha-lower-limit 70)

(setq scroll-margin 8)

(setq custom-safe-themes
   '("b2779867957a4b9de84bcd33c5ded92e943c710c4c5c5b7fc874786eaf63ca5c" "d395c1793e0d64797d711c870571a0033174ca321ed48444efbe640bf692bf4f" "11873c4fbf465b956889adfa9182495db3bf214d9a70c0f858f07f6cc91cbd47" "f82e68d489e6c21c9552c4e8e35a03d126d9eba632a8e7b4f9329d1374b4a19c" "eb7cd622a0916358a6ef6305e661c6abfad4decb4a7c12e73d6df871b8a195f8" "02f57ef0a20b7f61adce51445b68b2a7e832648ce2e7efb19d217b6454c1b644" "51ec7bfa54adf5fff5d466248ea6431097f5a18224788d0bd7eb1257a4f7b773" "285d1bf306091644fb49993341e0ad8bafe57130d9981b680c1dbd974475c5c7" "f5b6be56c9de9fd8bdd42e0c05fecb002dedb8f48a5f00e769370e4517dde0e8" "00445e6f15d31e9afaa23ed0d765850e9cd5e929be5e8e63b114a3346236c44c" "4c56af497ddf0e30f65a7232a8ee21b3d62a8c332c6b268c81e9ea99b11da0d3" default))

(load-theme 'solarized-gruvbox-light t)
(setq solarized-scale-org-headlines t)
(setq solarized-height-minus-1 0.9)
(setq solarized-height-plus-1 1.0)
(setq solarized-height-plus-2 1.1)
(setq solarized-height-plus-3 1.2)
(setq solarized-height-plus-4 1.3)

(setq doom-font (font-spec :family "Iosevka Custom" :size 16))
(setq doom-variable-pitch-font (font-spec :family "Iosevka Etoile" :size 16))
(setq! doom-unicode-font (font-spec :family "FiraCode Nerd Font"))

(setq display-line-numbers-type nil)
(if (string= (system-name) "Jasons-MacBook.local")
    (progn
      (+global-word-wrap-mode -1))
  (progn
    (+global-word-wrap-mode)))

(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)

(defadvice switch-to-buffer (before save-buffer-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice find-file (before save-buffer-now activate)
  (when buffer-file-name (save-buffer)))

(defadvice other-window (before other-window-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice windmove-right (before other-window-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice windmove-left (before other-window-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice windmove-down (before other-window-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice windmove-up (before other-window-now activate)
  (when buffer-file-name (save-buffer)))

(defadvice +workspace/cycle (before other-window-now activate)
  (when buffer-file-name (save-buffer)))
(defadvice +workspace/switch-to (before other-window-now activate)
  (when buffer-file-name (save-buffer)))

(defadvice other-frame (before other-frame-now activate)
  (when buffer-file-name (save-buffer)))

(global-evil-quickscope-mode +1)
;; don't cross lines, also won't cross visual lines
(setq evil-cross-lines nil)
(setq evil-quickscope-cross-lines nil)

(evil-snipe-mode +1)
(evil-snipe-override-mode -1)
(evil-snipe-override-local-mode -1)

(map! :after evil-snipe
      :map evil-quickscope-mode-map
      :m "t" nil
      :m "T" nil
      :m "f" #'evil-quickscope-find-char
      :m "F" #'evil-quickscope-find-char-backward
      :m "t" #'evil-snipe-f
      :m "T" #'evil-snipe-F
)

(defun prism-colors-solarized ()
  (interactive)
  (prism-set-colors :num 24
    :desaturations '(0) :lightens '(0)
    :colors (list 'all-the-icons-lblue 'font-lock-string-face 'font-lock-keyword-face 'ansi-color-magenta 'font-lock-builtin-face 'font-lock-type-face )
    :comments-fn (lambda (color)
                   (-->
                    (prism-blend color (face-attribute 'font-lock-comment-face :foreground) 0.40)))
    :strings-fn (lambda (color)
                  (--> color
                       (color-desaturate-name it 25)
                       (prism-blend it (face-attribute 'default :background) 0.70)))
  )
)
(after! prism (prism-colors-solarized))
(map! :after prism
      :leader "pmm" #'prism-mode)
(map! :after prism
      :leader "pmw" #'prism-whitespace-mode)

(when (not (string= (system-name) "Jasons-MacBook.local"))
  (progn
    ;;(fset 'rainbow-delimiters-mode #'prism-mode)
    (add-hook 'emacs-lisp-mode-hook 'prism-mode)
    (add-hook 'go-mode-hook 'prism-mode)
    (add-hook 'json-mode-hook 'prism-mode)
    (add-hook 'terraform-mode-hook 'prism-mode)
    (add-hook 'web-mode-hook 'prism-whitespace-mode)

    (add-hook 'python-mode-hook 'prism-whitespace-mode)))
