config.org
*** thicker git gutter
#+begin_src elisp
(after! git-gutter-fringe
  ;; I think this fixes the gutter disappearing issue: https://github.com/doomemacs/doomemacs/issues/4369
  (setq-default left-margin-width 1)
  (set-window-buffer nil (current-buffer))

  ;; standardize default fringe width
  ;; (if (fboundp 'fringe-mode) (fringe-mode '(8 . 8)))
  ;; thin fringe bitmaps
  (define-fringe-bitmap 'git-gutter-fr:added [#b111111] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [#b111111] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [#b111111] nil nil '(center repeated))
)
#+end_src

*** easier messages buffer
#+begin_src elisp
(evil-ex-define-cmd "mm" 'view-echo-area-messages)
#+end_src

*** zoom
#+begin_src elisp
(use-package zoom
  :config
  (setq zoom-size '(0.618 . 0.618)
        zoom-ignored-major-modes '(dired-mode vterm-mode help-mode helpful-mode rxt-help-mode help-mode-menu org-mode)
        zoom-ignored-buffer-names '("*doom:scratch*" "*info*" "*helpful variable: argv*")
        zoom-ignored-buffer-name-regexps '("^\\*calc" "\\*helpful variable: .*\\*")
        zoom-ignore-predicates (list (lambda () (< (count-lines (point-min) (point-max)) 20)))))

(evil-ex-define-cmd "zm" 'zoom-mode)
(define-key evil-normal-state-map (kbd "SPC zm") 'zoom-mode)

(plist-put +popup-defaults :select t)
;; workaround popup rule for Messages buffer and stuff so that :select t makes it so zoom doesn't break
(set-popup-rule! "^\\*\\(?:[Cc]ompil\\(?:ation\\|e-Log\\)\\|Messages\\)" :side 'bottom :size 0.3 :width 40 :height 0.3 :vslot -2 :quit t :select t :autosave t :parameters '((transient . t) (no-other-window . t)))
#+end_src

*** git gutter update interval
#+begin_src elisp
(setq git-gutter:update-interval 1)
#+end_src

*** ispell
#+begin_src elisp
(setq ispell-program-name (concat (getenv "HOMEBREW_PREFIX") "/bin/aspell"))
#+end_src

*** peek
really convenient package to store a region in any buffer and open an in-current-buffer peek "window"

"view-peek" for vp lol
#+begin_src elisp
(use-package! peek
  :config
  (progn
    (setq peek-overlay-distance 1)
    (map! :leader "vp" #'peek-overlay-dwim)))
#+end_src

*** EPUB reader nov

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

*** Visual Line Fringe indicator alist
for some reason my fringe indicators are gone
https://www.reddit.com/r/DoomEmacs/comments/ozbz9o/disabling_word_wrapping_everywhere/

jk it's cause of visual line mode
honestly this we don't really need it but I'm leaving this here in case we want to change it later
#+begin_src elisp
(setq visual-line-fringe-indicators '(nil nil))
#+end_src

*** avy timeout
just a slightly feels better than 0.5 I dunno
#+begin_src elisp
(setq avy-timeout-seconds 0.4)
#+end_src

*** indent guides and stuff :TinyMac:
#+begin_src elisp
(when (not (string= (system-name) "Jasons-MacBook.local"))
    (progn
        (setq highlight-indent-guides-auto-character-face-perc 35)
        (setq highlight-indent-guides-auto-top-character-face-perc 70)
        (setq highlight-indent-guides-method 'bitmap)
        (setq highlight-indent-guides-responsive 'top)
        (add-hook! 'prog-mode-hook (if (not (bound-and-true-p indent-tabs-mode)) (indent-bars-mode) (highlight-indent-guides-mode)))
        (add-hook! 'html-mode-hook (if (not (bound-and-true-p indent-tabs-mode)) (indent-bars-mode)))
    )
)
#+end_src

** Development
*** fix lookup :Doom:
#+begin_src elisp
(eval-after-load "lookup"
  (lambda ()
    (defun +lookup-project-search-backend-fn (identifier)
      "Conducts a simple project text search for IDENTIFIER.

  Uses and requires `+ivy-file-search', `+helm-file-search', or `+vertico-file-search'.
  Will return nil if neither is available. These require ripgrep to be installed."
      (when identifier
        (let ((query (rxt-quote-pcre identifier)))
          (ignore-errors
            (cond ((modulep! :completion ivy)
                   (+ivy-file-search :query query)
                   t)
                  ((modulep! :completion helm)
                   (+helm-file-search :query query)
                   t)
                  ((modulep! :completion vertico)
                   (+vertico-file-search :query query)
                   t)
                  )
            )
          )
        )
      )
    )
  )

(defun my/reference-lookup (identifier)
  (+default/search-project-for-symbol-at-point identifier (projectile-project-root)))
#+end_src

*** citre
#+begin_src elisp
(require 'citre)
(require 'citre-config)
(setq-default citre-enable-xref-integration t)
#+end_src

*** tramp:
#+begin_src elisp
(require 'tramp)
#+end_src

*** EAT (emulate a terminal)
#+begin_src elisp
(define-key evil-normal-state-map (kbd "SPC eat") 'eat-project)
(setq eat-enable-yank-to-terminal t)

(defun send-forward-word-to-eat ()
  (interactive)
  (eat-self-input 1 ?\M-f)
)

(defun send-backward-word-to-eat ()
  (interactive)
  (eat-self-input 1 ?\M-b)
)

;; There's no point in being in insert mode in eat terminal
;; for semi char mode at least
(map!
 :mode eat-mode
 :map eat-semi-char-mode-map
 :e "C-w k" #'windmove-up
 :e "C-w C-k" #'windmove-up

 :e "C-w j" #'windmove-down
 :e "C-w C-j" #'windmove-down

 :e "C-w l" #'windmove-right
 :e "C-w C-l" #'windmove-right

 :e "C-w h" #'windmove-left
 :e "C-w C-h" #'windmove-left

 :e "C-w C-q" #'evil-quit
 :e "C-w q" #'evil-quit

 :e "<ESC><ESC>" #'evil-force-normal-state
)

(map!
 :mode eat-mode
 :map (eat-semi-char-mode-map eat-char-mode-map)
 :i "M-<right>" #'send-forward-word-to-eat
 :i "M-<left>" #'send-backward-word-to-eat

 :n "s-v" #'eat-yank
 :v "s-v" #'eat-yank
 :i "s-v" #'eat-yank
 :e "s-v" #'eat-yank

 :n "p" #'eat-yank
 :v "p" #'eat-yank

 :m "C-S-p" #'eat-yank-from-kill-ring
)
#+end_src

*** set emacs mode as initial for terminals
#+begin_src elisp
(evil-set-initial-state 'eat-mode 'normal)
(evil-set-initial-state 'vterm-mode 'normal)
#+end_src

*** topsy
#+begin_src elisp
(add-hook 'prog-mode-hook #'topsy-mode)
(add-hook 'magit-section-mode-hook #'topsy-mode)
#+end_src

*** protobuf

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.proto\\'" . protobuf-mode))
#+end_src

*** terraform

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.tf\\'" . terraform-mode))
#+end_src

*** Go stuff

Set web mode engine for gohtml files

#+begin_src elisp
(setq web-mode-engines-alist '(("go" . "\\.gohtml\\'")))
(add-to-list 'auto-mode-alist '("\\.gohtml\\'" . html-mode))
(add-to-list 'auto-mode-alist '("\\.restclient\\'" . restclient-mode))
#+end_src

https://discourse.doomemacs.org/t/why-do-i-get-ugly-bright-tab-indentation-highlights/139/3
^ he notes that go uses tabs by default

https://stackoverflow.com/questions/29195496/how-to-turn-off-tab-highlighting-in-go-buffers
turn off whitespace mode in go-mode since gofmt uses tabs by default

see here as well: https://stackoverflow.com/questions/19094704/indentation-in-go-tabs-or-spaces
#+begin_src elisp
(setq whitespace-global-modes '(not go-mode))
#+end_src

Set go env variables when opening project
#+begin_src elisp
(require 'exec-path-from-shell)
(setq exec-path-from-shell-arguments '("-l"))
(defun go-update-env ()
  "sets go related environment variables to match the project's version specified by goenv"
  (interactive)
  (if (directory-files (projectile-project-root) :MATCH ".go-version")
      (progn
        (dolist (var '("GOMODCACHE" "GOPATH" "GOROOT" "GOTOOLDIR" "GOVERSION"))
          (add-to-list 'exec-path-from-shell-variables var))
        (exec-path-from-shell-initialize)
        (go-mode))
    (message "warning: no .go-version file found in project root"))
)
#+end_src

**** topsy with types and structs
#+begin_src elisp
(defun go--beginning-of-defun ()
  "Return the line moved to by `beginning-of-defun'."
  (when (> (window-start) 1)
    (save-excursion
      (goto-char (window-start))
      ;;^[[:blank]]* match blank at the beginning (so no comments)
      ;;want to match both struct/interfaces and functions definitions
      ;;pretty printing to get rid of escapes: (type .* (struct | interface).|func .*(.*).*){$
      ;; match type struct or type interface or func something () with { at the end
      (re-search-backward "^[[:blank:]]*\\(type .* \\(struct\\|interface\\).\\|func .*[(].*[)].*\\){$" nil t 1)
      (font-lock-ensure (point) (point-at-eol))
      (buffer-substring (point) (point-at-eol)))))

(after! topsy (add-to-list 'topsy-mode-functions '(go-mode . go--beginning-of-defun)))
#+end_src

**** use lsp-workspace-folders-add to manually add a project root in multi server projects instead
from here: https://github.com/emacs-lsp/lsp-mode/issues/1978
+custom solution to find the correct go subdir in a project+ Don't use this

*** Javascript
#+begin_src elisp
(setq js-indent-level 4)
#+end_src

