config.org
*** LSP
add some keybindings and stuff for lsp mode
#+begin_src elisp
(defun lsp-keybinds-and-stuff ()
  (define-key evil-normal-state-map (kbd "SPC lx") 'lsp-treemacs-errors-list)
  (define-key evil-normal-state-map (kbd "SPC fm") 'lsp-format-buffer)
  (define-key evil-normal-state-map (kbd "gp") 'lsp-ui-doc-glance)
  (evil-ex-define-cmd "fmt" 'lsp-format-buffer)
  (define-key evil-motion-state-map (kbd "C-]") '+lookup/references)
)
(add-hook 'lsp-mode-hook 'lsp-keybinds-and-stuff)
(setq lsp-ui-doc-show-with-mouse nil)
(setq lsp-ui-peek-always-show nil)
#+end_src

file watchers, enabling for now, but this can make lsp slow
#+begin_src elisp
(setq lsp-enable-file-watchers nil)
#+end_src

execute code lens from cli
#+begin_src elisp
(define-key evil-normal-state-map (kbd "SPC ll") 'lsp-avy-lens)
#+end_src

*** magit
**** map enter to open file in other window in diffs and stuff
#+begin_src elisp
(defun magit-mappings ()
  (define-key magit-hunk-section-map (kbd "RET") 'magit-diff-visit-file-other-window)
  (define-key magit-hunk-section-map (kbd "<S-return>") 'magit-diff-visit-worktree-file)
  (define-key magit-hunk-section-map (kbd "<C-return>") 'magit-diff-visit-worktree-file-other-window)

  (define-key magit-file-section-map (kbd "RET") 'magit-diff-visit-file-other-window)
  (define-key magit-file-section-map (kbd "<S-return>") 'magit-diff-visit-worktree-file)
  (define-key magit-file-section-map (kbd "<C-return>") 'magit-diff-visit-worktree-file-other-window)
)

(with-eval-after-load "magit" (magit-mappings))
(add-hook 'git-gutter:update-hooks 'magit-after-revert-hook)
(add-hook 'git-gutter:update-hooks 'magit-not-reverted-hook)
#+end_src

**** better evil magit movement
#+begin_src elisp
(map! :after magit
      :map magit-mode-map
      :n "l" #'evil-forward-char
      :n "C-l" #'magit-log

      :n "h" #'evil-backward-char
      :n "C-h" #'magit-dispatch

      :n "^" #'evil-first-non-blank
      :n "w" #'evil-forward-word-begin

      :n "b" #'evil-backward-word-begin
      :n "C-b" #'magit-branch
)
#+end_src


*** Company stuff: :TinyMac:
#+begin_src elisp
(setq company-idle-delay 0.5)
(add-hook! 'prog-mode-hook (setq company-idle-delay (if (string= (system-name) "Jasons-MacBook.local") nil 0.3)))
(add-hook! 'org-mode-hook (setq company-idle-delay nil)) ;; company is kind of annoying in org-mode
(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
#+end_src

** Org stuff
*** Capture templates
#+begin_src elisp
(after! org
    (add-to-list 'org-capture-templates '("w" "Workout Item" entry (file+headline "~/orgmode/roam/iCloudOrg/workout-tracking.org" "Workout")
    "* %U
    :PROPERTIES:
    :WEIGHT:
    :REPS:
    :VISIBILITY: folded
    :END:
    "))

    (add-to-list 'org-capture-templates '("W" "Workout Day" entry (file+headline "~/orgmode/roam/iCloudOrg/workout-tracking.org" "Workout")
    "* %u
    :PROPERTIES:
    :COLUMNS: %20ITEM %WEIGHT{max} %REPS{max}
    :VISIBILITY: folded
    :END:
    "))
)
#+end_src

*** insert seconds timestamp command
#+begin_src elisp
(defun my/org-insert-time-stamp-with-seconds ()
  (interactive)
  (insert (format-time-string "[%Y-%m-%d %a %H:%M:%S]" (current-time)))
)
(map! :after evil-org
      :map org-mode-map
      :ni "C-c m t s" #'my/org-insert-time-stamp-with-seconds
)
#+end_src

*** org movement
#+begin_src elisp
(map! :after evil-org
      :map org-mode-map
      :ni "C-c C-u" #'outline-up-heading
)
#+end_src

*** Prettier

#+begin_src elisp
(setq org-hide-emphasis-markers t)
(setq org-superstar-headline-bullets-list '("🚀" "✿" "✐" "✦" "✸"))
(setq org-startup-indented t)

(after! org-modern-indent
  (set-face-attribute 'org-modern-bracket-line nil :inherit 'font-lock-comment-face)
)
(add-hook 'org-mode-hook 'org-modern-indent-mode)
#+end_src

https://emacs.stackexchange.com/questions/48063/org-ellipsis-displayed-inorrectly-for-some-headlines-only
  - workaround for issue with ellipsis not properly showing if there's a blank line before the start of the next headline
More fun ellipsis, variable pitch needed or else we get the weird box,
  - done via setting the org-ellipsis face in custom.el
#+begin_src elisp
(after! org
  (setq org-ellipsis "  ⤵")
  (setq org-cycle-separator-lines -1)
  (setq org-tags-column 0)
)
#+end_src

*** inline image width default
#+begin_src elisp
(after! org
  (setq org-image-actual-width '(300))
)
#+end_src

*** tables
#+begin_src elisp
(map! :after evil-org
      :map org-mode-map
      :n "C-c t s" #'org-table-shrink
      :n "C-c t e" #'org-table-expand
)
#+end_src

*** change `org-directory' to ~/orgmode/,
#+begin_src elisp
;; must be set BEFORE org loads so don't put this in an after! org block
(setq org-directory "~/orgmode/")
#+end_src

*** org babel setup
#+begin_src elisp
(map! :after evil-org
      :map emacs-lisp-mode-map
      :n "C-c C-v C-o" #'org-babel-tangle-jump-to-org
      :n "C-c C-v o" #'org-babel-tangle-jump-to-org
)
#+end_src

**** protobuf highlighting in src block
#+begin_src elisp
(after! org
  (org-babel-do-load-languages
   'org-babel-load-languages
   (append org-babel-load-languages '((protobuf-mode . t)))))
#+end_src

**** plantuml setup and download if doesn't exist
might need to add plantuml to =org-babel-do-load-languages=
#+begin_src elisp
(let* ((plantuml_path (expand-file-name "~/orgmode/plantuml.jar")))
  (setq org-plantuml-jar-path plantuml_path)
  (setq plantuml-jar-path plantuml_path)
  (if (file-exists-p plantuml_path)
    nil
    (plantuml-download-jar)
  )
)
(setq plantuml-default-exec-mode 'jar)
#+end_src

**** Don't match ' in org mode src blocks
https://emacs.stackexchange.com/questions/56071/smartparens-does-not-work-well-in-orgmode
https://github.com/Fuco1/smartparens/issues/1017

#+begin_src elisp
;; I believe this sets the smart parens to match the major mode of the src block
;; which is why we needed to change "elisp-mode" to "emacs-lisp-mode"
(defun sp-in-src-block-p (_id _action _context)
  (when (org-in-src-block-p)
    (let* ((el (org-element-at-point))
            (lang (org-element-property :language el))
            (mode (intern (concat (if (string= lang "elisp") "emacs-lisp" lang) "-mode"))))
      (memq mode sp-lisp-modes))))

(after! smartparens
  (require 'smartparens-config)
  (sp-local-pair 'org-mode "\\[" "\\]")
  ;;(sp-local-pair 'org-mode "$" "$")
  (sp-local-pair 'org-mode "'" "'" :unless '(:add sp-in-src-block-p))
  (sp-local-pair 'org-mode "=" "=" :actions '(rem))
  (sp-local-pair 'org-mode "\\left(" "\\right)" :trigger "\\l(" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left[" "\\right]" :trigger "\\l[" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left\\{" "\\right\\}" :trigger "\\l{" :post-handlers '(sp-latex-insert-spaces-inside-pair))
  (sp-local-pair 'org-mode "\\left|" "\\right|" :trigger "\\l|" :post-handlers '(sp-latex-insert-spaces-inside-pair))
)
#+end_src

*** org habit settings
#+begin_src elisp
(use-package! org-habit
  :after org
  :config
  (setq org-habit-following-days 7
        org-habit-preceding-days 35
        org-habit-show-habits t
        org-habit-show-habits-only-for-today nil))
#+end_src

*** Org edna mode settings
#+begin_src elisp
(add-hook 'org-mode-hook 'org-edna-mode)
#+end_src

*** Org notifications
*NOTE* The SCHEDULED cookie has to be on a new line for org-yaap to recognize
Needs to be *Alert* style instead of *Banner* style in osx settings
#+begin_src elisp
(setq alert-default-style 'osx-notifier)
(after! org-yaap
  (setq org-yaap-daily-alert 12)
  (setq org-yaap-alert_before 5)
  (setq org-yaap-overdue-alerts nil)
  (setq org-yaap-persistent-click t)
  (setq org-yaap-persistent-clock t)
)
(define-advice notifications-notify
    (:override (&rest params) using-alert)
  (alert (string-trim (replace-regexp-in-string "[^[:ascii:]]+" "" (plist-get params :body)))
         :title (plist-get params :title)))
(add-hook 'org-mode-hook 'org-yaap-mode)
#+end_src

*** Don't auto indent on RET in org-mode
stole from here: https://github.com/doomemacs/doomemacs/issues/3872
basically we can just rely on the org-auto-indent-mode instead

this kinda breaks org auto list mode but meh

#+begin_src elisp
(map! :after evil-org
      :map evil-org-mode-map
      :i [return] #'+default/newline
      :i "RET" #'+default/newline)
#+end_src

*** Org sticky header
#+begin_src elisp
(add-hook 'org-mode-hook 'org-sticky-header-mode)
#+end_src

