config.org
*** org roam setup
org roam ui setup
#+begin_src elisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

#+begin_src elisp
(after! org (setq org-roam-directory "~/orgmode/roam/") (setq org-roam-index-file "~/orgmode/roam/index.org"))
(map! :after evil-org
      :map evil-org-mode-map
      :n "C-c n n" #'org-roam-buffer-toggle
      :n "C-c n f" #'org-roam-node-find
      :n "C-c n r" #'org-roam-node-random
      :n "C-c n i" #'org-roam-node-insert
      :n "C-c n o" #'org-id-get-create
      :n "C-c n t" #'org-roam-tag-add
      :n "C-c n a" #'org-roam-alias-add
      :n "C-c n l" #'org-roam-buffer-toggle)
#+end_src

This fixes an issue with when there's some splits, the org roam find command truncates the search results:
solution was taken from here: https://github.com/org-roam/org-roam/issues/2143#issuecomment-1087859891
#+begin_src elisp
(defun my/org-roam-node-read--to-candidate (node template)
    "Return a minibuffer completion candidate given NODE.
  TEMPLATE is the processed template used to format the entry."
    (let ((candidate-main (org-roam-node--format-entry
                           template
                           node
                           (1- (frame-width)))))
      (cons (propertize candidate-main 'node node) node)))

(advice-add 'org-roam-node-read--to-candidate :override #'my/org-roam-node-read--to-candidate)
#+end_src

setting up dailies
#+begin_src elisp
(after! org
  (setq org-roam-dailies-directory "daily/")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
          "* %?"
          :target (file+head "%<%Y-%m-%d>.org"
                              "#+title: %<%Y-%m-%d>\n"))))
)
#+end_src

*** agenda

**** org agenda files
#+begin_src elisp
(setq org-agenda-files
  (list (expand-file-name "AGENDA_FILE.org")))
#+end_src

**** org agenda format
#+begin_src elisp
(after! org
  (setq org-agenda-prefix-format
    '((agenda . " %i %16:c %?-12t% s")
      (todo . " %i %-12:c")
      (tags . " %i %-12:c")
      (search . " %i %-12:c")))
)
#+end_src

**** ignore scheduled todos in agenda

#+begin_src elisp
(after! org
  (setq org-agenda-todo-ignore-scheduled 'all)
)
#+end_src

**** shorter agenda now string
#+begin_src elisp
(after! org
  (setq org-agenda-current-time-string "← now ─────────")
  (setq org-agenda-current-time-string "󰇥 󰇥 󰇥 〰〰〰〰〰〰")
)
#+end_src

**** skip deadline and scheduled
#+begin_src elisp
(after! org
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
)
#+end_src

**** agenda prev/next frame mapping
#+begin_src elisp
(map! :after evil-org-agenda
      :map evil-org-agenda-mode-map
      :m "[" nil
      :m "]" nil
      :m "[a" #'org-agenda-earlier
      :m "]a" #'org-agenda-later
      :m "[F" #'+evil/previous-frame
      :m "]F" #'+evil/next-frame
)
#+end_src

*** Load health-template
https://www.youtube.com/watch?app=desktop&v=YmQ1CYMz-OY
#+begin_src elisp
(use-package! health-template)
#+end_src

** evil mode
Keybindings for some tools

*** qol changes

very annoying thing where ^ wouldn't respect visual lines, but C-a does which was
doom/backward-to-bol-or-indent so might as well just map it
#+begin_src elisp
(map! :after evil
      :m "^" nil
      :m "^" #'doom/backward-to-bol-or-indent
)
#+end_src

*** modeline
Show text instead of icon for vim mode
#+begin_src elisp
(setq doom-modeline-modal-icon nil)
#+end_src

*** yanking use the consult version if using vertico
#+begin_src elisp :tangle no

(define-key evil-normal-state-map (kbd "C-S-p") 'yank-from-kill-ring)
(define-key evil-insert-state-map (kbd "C-S-p") 'yank-from-kill-ring)
#+end_src

*** vertico commands
#+begin_src elisp
(after! vertico
  (define-key evil-normal-state-map (kbd "SPC F") 'projectile-find-file)
  (define-key evil-normal-state-map (kbd "SPC G") '+vertico/project-search)
  (define-key evil-visual-state-map (kbd "SPC G") '+vertico/project-search)

  (define-key vertico-map (kbd "C-d") 'vertico-scroll-up)
  (define-key vertico-map (kbd "C-u") 'vertico-scroll-down)
  (define-key vertico-map (kbd "C-w C-w") 'previous-window-any-frame)

  (define-key vertico-map (kbd "C-S-n") 'vertico-next-group)
  (define-key vertico-map (kbd "C-S-p") 'vertico-previous-group)

  (define-key evil-normal-state-map (kbd "C-S-p") 'consult-yank-from-kill-ring)
  (define-key evil-insert-state-map (kbd "C-S-p") 'consult-yank-from-kill-ring)
)
#+end_src

*** ivy commands :UNUSED:
#+begin_src elisp :tangle no
;; allow evil scrolling in mini buffer
(after! ivy
  (define-key evil-normal-state-map (kbd "SPC F") '+ivy/projectile-find-file)
  (define-key evil-normal-state-map (kbd "SPC G") '+ivy/project-search)
  (define-key evil-visual-state-map (kbd "SPC G") '+ivy/project-search)

  (define-key ivy-minibuffer-map (kbd "<C-S-d>") 'evil-delete-back-to-indentation)
  (define-key ivy-minibuffer-map (kbd "C-d") 'ivy-scroll-up-command)
  (define-key ivy-minibuffer-map (kbd "C-u") 'ivy-scroll-down-command)
)
#+end_src

*** navigation
#+begin_src elisp
(define-key evil-normal-state-map (kbd "C-t") 'pop-global-mark)
(better-jumper-mode +1)
(define-key evil-motion-state-map (kbd "<C-o>") 'better-jumper-jump-backward)
(define-key evil-motion-state-map (kbd "<C-i>") 'better-jumper-jump-forward)
(setq-default evil-escape-key-sequence "kj")
#+end_src

*** ranger
#+begin_src elisp
(evil-define-command evil-ex-ranger (path)
  (interactive "<a>")
  (if
      (= (length (window-list)) 1)
      (if path (ranger-find-file (expand-file-name path)) (ranger))
      (dired (expand-file-name path)))
)
(evil-ex-define-cmd "e" #'evil-ex-ranger)
(setq ranger-show-hidden t)
#+end_src

*** quitting
:q should kill the current buffer rather than quitting emacs entirely
Need to type out :quit to close emacs
#+begin_src elisp
(evil-ex-define-cmd "q" 'kill-this-buffer)
(evil-ex-define-cmd "quit" 'evil-quit)
#+end_src

*** subword
this thing lets us use move commands on things like camel case and stuff
The second line treats _ as a "whitespace" character so that evil-forward-begin stops at "_" characters
-> is somewhat of a fix for weird behaviour where evil-forward-begin gets stuck with words with underscore
#+begin_src elisp
(global-subword-mode)
(add-hook! 'prog-mode-hook (modify-syntax-entry ?_ "-"))
(add-hook! 'org-mode-hook (modify-syntax-entry ?_ "-"))
#+end_src

skip dashes and underscores in forward word begin and stuff
#+begin_src elisp
(defun skip-dash-forward (n &rest foo)
  (when (or (eq (char-after (point)) ?-) (eq (char-after (point)) ?_))
    (forward-char)))

(defun skip-dash-forward-end (n &rest foo)
  (if (or (eq (char-after (point)) ?-) (eq (char-after (point)) ?_))
      (forward-char)))

(defun skip-dash-backward (n &rest foo)
  (when (or (eq (char-before (point)) ?-) (eq (char-before (point)) ?_))
    (backward-char)))

(advice-add 'evil-forward-word-begin :after #'skip-dash-forward)
(advice-add 'evil-forward-word-end :after #'skip-dash-forward-end)
(advice-add 'evil-backward-word-begin :before #'skip-dash-backward)
#+end_src

*** workspaces, persp mode keybinds :Doom:

#+begin_src elisp
(define-key evil-normal-state-map (kbd "C-c p [") #'+workspace/swap-left)
(define-key evil-normal-state-map (kbd "C-c p ]") #'+workspace/swap-right)
#+end_src

minor workaround so workspace switching doesn't have an off by one error
#+begin_src elisp
(evil-define-command my-workspace-switch-next (&optional count)
  (interactive "<c>")
  (if count (+workspace/switch-to (- count 1)) (+workspace/cycle +1))
)

(evil-define-command my-workspace-switch-prev (&optional count)
  (interactive "<c>")
  (if count (+workspace/switch-to (- count 1)) (+workspace/cycle -1))
)

(define-key evil-normal-state-map (kbd "gt") 'my-workspace-switch-next)
(define-key evil-normal-state-map (kbd "gT") 'my-workspace-switch-prev)
#+end_src

*** prefer hs-minor-mode
simpler than the other ones and works for my use case well enough, + fast + built in
ts-fold is slow as hell
vimish-fold doesn't have recursive opening
#+begin_src elisp
(map! :after hideshow
      :mode prog-mode
      :n "zC" nil
      :n "zO" nil
      :n "zo" nil
      :n "zc" nil
      :n "za" nil
      :n "zC" #'hs-hide-all
      :n "zO" #'hs-show-all
      :n "zo" #'hs-show-block
      :n "zc" #'hs-hide-block
      :n "za" #'hs-toggle-hiding
)
#+end_src

*** flycheck binding
#+begin_src elisp
(map! :after flycheck
      :mode flycheck-mode
      :n "[e" nil
      :n "]e" nil
      :n "[e" #'flycheck-previous-error
      :n "]e" #'flycheck-next-error
)
#+end_src

