config.el

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(after! org (setq org-roam-directory "~/orgmode/roam/") (setq org-roam-index-file "~/orgmode/roam/index.org"))
(map! :after evil-org
      :map evil-org-mode-map
      :n "C-c n n" #'org-roam-buffer-toggle
      :n "C-c n f" #'org-roam-node-find
      :n "C-c n r" #'org-roam-node-random
      :n "C-c n i" #'org-roam-node-insert
      :n "C-c n o" #'org-id-get-create
      :n "C-c n t" #'org-roam-tag-add
      :n "C-c n a" #'org-roam-alias-add
      :n "C-c n l" #'org-roam-buffer-toggle)

(defun my/org-roam-node-read--to-candidate (node template)
    "Return a minibuffer completion candidate given NODE.
  TEMPLATE is the processed template used to format the entry."
    (let ((candidate-main (org-roam-node--format-entry
                           template
                           node
                           (1- (frame-width)))))
      (cons (propertize candidate-main 'node node) node)))

(advice-add 'org-roam-node-read--to-candidate :override #'my/org-roam-node-read--to-candidate)

(after! org
  (setq org-roam-dailies-directory "daily/")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
          "* %?"
          :target (file+head "%<%Y-%m-%d>.org"
                              "#+title: %<%Y-%m-%d>\n"))))
)

(setq org-agenda-files
  (list (expand-file-name "AGENDA_FILE.org")))

(after! org
  (setq org-agenda-prefix-format
    '((agenda . " %i %16:c %?-12t% s")
      (todo . " %i %-12:c")
      (tags . " %i %-12:c")
      (search . " %i %-12:c")))
)

(after! org
  (setq org-agenda-todo-ignore-scheduled 'all)
)

(after! org
  (setq org-agenda-current-time-string "← now ─────────")
  (setq org-agenda-current-time-string "󰇥 󰇥 󰇥 〰〰〰〰〰〰")
)

(after! org
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
)

(map! :after evil-org-agenda
      :map evil-org-agenda-mode-map
      :m "[" nil
      :m "]" nil
      :m "[a" #'org-agenda-earlier
      :m "]a" #'org-agenda-later
      :m "[F" #'+evil/previous-frame
      :m "]F" #'+evil/next-frame
)

(use-package! health-template)

(map! :after evil
      :m "^" nil
      :m "^" #'doom/backward-to-bol-or-indent
)

(setq doom-modeline-modal-icon nil)

(after! vertico
  (define-key evil-normal-state-map (kbd "SPC F") 'projectile-find-file)
  (define-key evil-normal-state-map (kbd "SPC G") '+vertico/project-search)
  (define-key evil-visual-state-map (kbd "SPC G") '+vertico/project-search)

  (define-key vertico-map (kbd "C-d") 'vertico-scroll-up)
  (define-key vertico-map (kbd "C-u") 'vertico-scroll-down)
  (define-key vertico-map (kbd "C-w C-w") 'previous-window-any-frame)

  (define-key vertico-map (kbd "C-S-n") 'vertico-next-group)
  (define-key vertico-map (kbd "C-S-p") 'vertico-previous-group)

  (define-key evil-normal-state-map (kbd "C-S-p") 'consult-yank-from-kill-ring)
  (define-key evil-insert-state-map (kbd "C-S-p") 'consult-yank-from-kill-ring)
)

(define-key evil-normal-state-map (kbd "C-t") 'pop-global-mark)
(better-jumper-mode +1)
(define-key evil-motion-state-map (kbd "<C-o>") 'better-jumper-jump-backward)
(define-key evil-motion-state-map (kbd "<C-i>") 'better-jumper-jump-forward)
(setq-default evil-escape-key-sequence "kj")

(evil-define-command evil-ex-ranger (path)
  (interactive "<a>")
  (if
      (= (length (window-list)) 1)
      (if path (ranger-find-file (expand-file-name path)) (ranger))
      (dired (expand-file-name path)))
)
(evil-ex-define-cmd "e" #'evil-ex-ranger)
(setq ranger-show-hidden t)

(evil-ex-define-cmd "q" 'kill-this-buffer)
(evil-ex-define-cmd "quit" 'evil-quit)

(global-subword-mode)
(add-hook! 'prog-mode-hook (modify-syntax-entry ?_ "-"))
(add-hook! 'org-mode-hook (modify-syntax-entry ?_ "-"))

(defun skip-dash-forward (n &rest foo)
  (when (or (eq (char-after (point)) ?-) (eq (char-after (point)) ?_))
    (forward-char)))

(defun skip-dash-forward-end (n &rest foo)
  (if (or (eq (char-after (point)) ?-) (eq (char-after (point)) ?_))
      (forward-char)))

(defun skip-dash-backward (n &rest foo)
  (when (or (eq (char-before (point)) ?-) (eq (char-before (point)) ?_))
    (backward-char)))

(advice-add 'evil-forward-word-begin :after #'skip-dash-forward)
(advice-add 'evil-forward-word-end :after #'skip-dash-forward-end)
(advice-add 'evil-backward-word-begin :before #'skip-dash-backward)

(define-key evil-normal-state-map (kbd "C-c p [") #'+workspace/swap-left)
(define-key evil-normal-state-map (kbd "C-c p ]") #'+workspace/swap-right)

(evil-define-command my-workspace-switch-next (&optional count)
  (interactive "<c>")
  (if count (+workspace/switch-to (- count 1)) (+workspace/cycle +1))
)

(evil-define-command my-workspace-switch-prev (&optional count)
  (interactive "<c>")
  (if count (+workspace/switch-to (- count 1)) (+workspace/cycle -1))
)

(define-key evil-normal-state-map (kbd "gt") 'my-workspace-switch-next)
(define-key evil-normal-state-map (kbd "gT") 'my-workspace-switch-prev)

(map! :after hideshow
      :mode prog-mode
      :n "zC" nil
      :n "zO" nil
      :n "zo" nil
      :n "zc" nil
      :n "za" nil
      :n "zC" #'hs-hide-all
      :n "zO" #'hs-show-all
      :n "zo" #'hs-show-block
      :n "zc" #'hs-hide-block
      :n "za" #'hs-toggle-hiding
)

(map! :after flycheck
      :mode flycheck-mode
      :n "[e" nil
      :n "]e" nil
      :n "[e" #'flycheck-previous-error
      :n "]e" #'flycheck-next-error
)
